In [28]:
import pandas as pd
import numpy as np

In [2]:
# membuat dataframe
data = pd.DataFrame({'nama': ['Dila', 'Muiz', 'Naufal', 'Adel', 'Gema'],
                     'usia': [25, 30, 27, 22, 28],
                     'pekerjaan': ['programmer', 'desainer', 'manager', 'programmer', 'analyst']})

# subsetting berdasarkan kondisi
# Memilih baris data yang memiliki nilai usia lebih besar dari 25.
subset1 = data[data['usia'] > 25]

# subsetting kolom tertentu
# Memilih kolom nama dan pekerjaan.
subset2 = data[['nama', 'pekerjaan']]

# subsetting baris dan kolom tertentu
# Memilih baris ke-2 dan ke-4, serta kolom nama dan usia.
subset3 = data.loc[[1,3], ['nama', 'usia']]

# subsetting menggunakan range
# Memilih baris ke-2 dan ke-3, serta kolom ke-1 dan ke-2.
subset4 = data.iloc[1:3, 0:2]

In [8]:
subset1

     nama  usia pekerjaan
1    Muiz    30  desainer
2  Naufal    27   manager
4    Gema    28   analyst

In [9]:
subset2

     nama   pekerjaan
0    Dila  programmer
1    Muiz    desainer
2  Naufal     manager
3    Adel  programmer
4    Gema     analyst

In [10]:
subset3

   nama  usia
1  Muiz    30
3  Adel    22

In [11]:
subset4

     nama  usia
1    Muiz    30
2  Naufal    27

In [20]:
# membuat dataframe
data = pd.DataFrame({'nama': ['Dandi', 'Rhein', 'Kinan', 'Dini', 'Eva'],
                     'usia': [25, 30, 27, 22, 28],
                     'pekerjaan': ['programmer', 'desainer', 'manager', 'programmer', 'analyst']})

# filtering berdasarkan kondisi
# Memilih baris data yang memiliki nilai usia lebih besar dari 25.
filtered1 = data[data['usia'] > 25]

# filtering dengan operator logika
# Memilih baris data yang memiliki nilai usia lebih besar dari 25 dan pekerjaan sebagai programmer.
filtered2 = data[(data['usia'] > 25) & (data['pekerjaan'] == 'programmer')]

# filtering menggunakan metode .query
# Memilih baris data yang memiliki nilai usia lebih besar dari 25 dan pekerjaan sebagai programmer menggunakan metode .query.
filtered3 = data.query('usia > 25 and pekerjaan == "programmer"')

# filtering menggunakan metode .loc
# Memilih baris data yang memiliki nilai usia lebih besar dari 25 dan pekerjaan sebagai programmer, serta memilih kolom nama dan usia menggunakan metode .loc.
filtered4 = data.loc[(data['usia'] > 25) & (data['pekerjaan'] == 'programmer'), ['nama', 'usia']]

In [21]:
filtered1

    nama  usia pekerjaan
1  Rhein    30  desainer
2  Kinan    27   manager
4    Eva    28   analyst

In [22]:
filtered2

Empty DataFrame
Columns: [nama, usia, pekerjaan]
Index: []

In [23]:
filtered3

Empty DataFrame
Columns: [nama, usia, pekerjaan]
Index: []

In [24]:
filtered4

Empty DataFrame
Columns: [nama, usia]
Index: []

In [25]:
# membuat dataframe
data = pd.DataFrame({'nama': ['Ica', 'Luqna', 'Fatima', 'Redi', 'Juli'],
                     'usia': [25, 30, 27, 22, 28],
                     'pekerjaan': ['programmer', 'desainer', 'manager', 'programmer', 'analyst']})

# grouping berdasarkan kolom pekerjaan
grouped1 = data.groupby('pekerjaan')

# menghitung jumlah data pada setiap kelompok pekerjaan
counted1 = grouped1.size()

# menghitung nilai rata-rata usia pada setiap kelompok pekerjaan
mean1 = grouped1.mean()['usia']

# grouping dan menghitung nilai rata-rata usia pada setiap kelompok pekerjaan
mean2 = data.groupby('pekerjaan')['usia'].mean()

In [26]:
grouped1

In [29]:
mean1

pekerjaan
analyst       28.0
desainer      30.0
manager       27.0
programmer    23.5
Name: usia, dtype: float64

In [30]:
mean2

pekerjaan
analyst       28.0
desainer      30.0
manager       27.0
programmer    23.5
Name: usia, dtype: float64

In [27]:
# membuat dataframe
data = pd.DataFrame({'nilai1': [75, 82, 92, 68, 70, 85, 99, 105, 110, 80],
                     'nilai2': [3, 4, 5, 2, 1, 7, 9, 10, 12, 6]})

# menyortir data pada setiap variabel
sorted_data = data.apply(sorted)

# mengambil nilai terendah dan tertinggi pada setiap variabel
low_values = sorted_data.iloc[:2, :][1]
high_values = sorted_data.iloc[-2:, :][0]

# mendeteksi multivariat outliers
outliers = data[((data.iloc[:, 0] < low_values[0]) | (data.iloc[:, 0] > high_values[0])) & ((data.iloc[:, 1] < low_values[1]) | (data.iloc[:, 1] > high_values[1]))]

# print multivariat outliers
print(outliers)

KeyError: 1

In [31]:
from scipy import stats

# membuat dataframe
data = pd.DataFrame({'nilai1': [75, 82, 92, 68, 70, 85, 99, 105, 110, 80],
                     'nilai2': [3, 4, 5, 2, 1, 7, 9, 10, 12, 6]})

# menghitung z-score
z = np.abs(stats.zscore(data))

# menentukan batas z-score
threshold = 3

# mendeteksi multivariat outliers
outliers = data[(z > threshold).any(axis=1)]

# print multivariat outliers
print(outliers)

Empty DataFrame
Columns: [nilai1, nilai2]
Index: []

In [32]:
z

     nilai1    nilai2
0  0.843241  0.848185
1  0.334389  0.555708
2  0.392543  0.263230
3  1.352093  1.140663
4  1.206706  1.433141
5  0.116309  0.321725
6  0.901395  0.906681
7  1.337554  1.199159
8  1.701020  1.784114
9  0.479775  0.029248

In [34]:
# membuat dataframe dengan nilai yang hilang
df = pd.DataFrame({'A': [1, 2, None, 4], 'B': [5, None, 7, 8]})

# mengisi nilai yang hilang dengan rata-rata kolom
df.fillna(df.mean(), inplace=True)

df

          A         B
0  1.000000  5.000000
1  2.000000  6.666667
2  2.333333  7.000000
3  4.000000  8.000000

In [37]:
# membuat dataframe dengan nilai yang hilang
df = pd.DataFrame({'A': [1, 2, None, 4], 'B': [5, None, 7, 8]})

# mengisi nilai yang hilang dengan nilai sebelumnya (forward filling)
df.fillna(method='ffill', inplace=True)

df

     A    B
0  1.0  5.0
1  2.0  5.0
2  2.0  7.0
3  4.0  8.0

In [41]:
from sklearn.impute import KNNImputer
import pandas as pd

# membuat dataframe dengan nilai yang hilang
df = pd.DataFrame({'A': [1, 2, None, 4], 'B': [5, None, 7, 8]})

# mengisi nilai yang hilang dengan KNN imputer
imputer = KNNImputer(n_neighbors=2)
df_imputed = pd.DataFrame(imputer.fit_transform(df))

df_imputed

     0    1
0  1.0  5.0
1  2.0  6.5
2  2.5  7.0
3  4.0  8.0